---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosed
source: html/4656a84f-b64c-a5ee-e1a1-58bc330d9319.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosed Property

[Room] is not in a properly enclosed region

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotEnclosed { get; }
```